Revit 2024 API
BackgroundImageFit Enumeration
 Indicates the background image fit type in rendering settings.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public enum BackgroundImageFit
Visual Basic
Public Enumeration BackgroundImageFit
Visual C++
public enum class BackgroundImageFit
Members
Member name | Description
None |  No scale applied to the image; it will keep its original size.
Vertical |  The image is proportionally resized so its height matches the view's height.
Horizontal |  The image is proportionally resized so its width matches the view's width.
Stretch |  The image is stretched in both directions so it matches the view's size.
See Also
Autodesk.Revit.DB Namespace